; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 340159 1 2 3 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	image2 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star5 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Star8 image2)
	(have_image Planet9 thermograph1)
	(have_image Star10 image2)
	(have_image Planet11 image2)
	(have_image Planet12 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
3. (turn_to satellite0 star5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star5)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 star8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
6. (take_image satellite0 star8 instrument0 image2)
   added: (have_image star8 image2)
   goals met: 1 of 5
7. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   goals met: 1 of 5
8. (take_image satellite0 star10 instrument0 image2)
   added: (have_image star10 image2)
   goals met: 2 of 5
9. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 2 of 5
10. (take_image satellite0 planet9 instrument0 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 3 of 5
11. (turn_to satellite0 planet12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet12)
   goals met: 3 of 5
12. (take_image satellite0 planet12 instrument0 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 4 of 5
13. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 4 of 5
14. (take_image satellite0 planet11 instrument0 image2)
   added: (have_image planet11 image2)
   goals met: 5 of 5
